Table of Contents
 Class SetupValue
Namespace
IdeaRS.OpenModel.Concrete
Assembly
IdeaRS.OpenModel.dll
Setup value base
public abstract class SetupValue
Inheritance
object
SetupValue
Derived
SetupValueBool
SetupValueDouble
SetupValueFloat
SetupValueInt
SetupValueLong
SetupValueShort
Inherited Members
 object.Equals(object)
 object.Equals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
 object.ReferenceEquals(object, object)
 object.ToString()
Properties
 Id
Gets or sets the value id.
public int Id { get; set; }
Property Value
int
 Edit this page